nacaAirfoil_n0012familyII2hex_compressible_SST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            patch;
        nFaces          3670016;
        startFace       7336192;
    }
    Back
    {
        type            patch;
        nFaces          3670016;
        startFace       11006208;
    }
    outlet1
    {
        type            patch;
        nFaces          1024;
        startFace       14676224;
    }
    outlet2
    {
        type            patch;
        nFaces          1024;
        startFace       14677248;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2048;
        startFace       14678272;
    }
    inlet
    {
        type            patch;
        nFaces          3584;
        startFace       14680320;
    }
)

// ************************************************************************* //
