nacaAirfoil_n0012familyII2hex_compressible_SST/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
speed           250;
angleOfAttack   0; // degs

angle           #calc "-degToRad($angleOfAttack)";

#calcInclude    "transform.H"
liftDir         #calc "transform(Ry($angle), vector(0, 0, 1))";
dragDir         #calc "transform(Ry($angle), vector(1, 0, 0))";

Uinlet          #calc "$speed*$<vector>dragDir";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            $Uinlet;
        gamma           1.4;
        value           uniform $Uinlet;
    }

   outlet1
    {
        type            inletOutlet;
        inletValue      uniform $Uinlet;
        value           uniform $Uinlet;
    }
   outlet2
    {
        type            inletOutlet;
        inletValue      uniform $Uinlet;
        value           uniform $Uinlet;
    }

     front
    {
        type            empty;
    }

     Back
    {
        type            empty;
    }

    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
