nacaAirfoil_n0012familyII2hex_compressible_SST/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet1
    {
        type            waveTransmissive;
        field           p;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }
    outlet2
    {
        type            waveTransmissive;
        field           p;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }
    front
    {
        type            empty;
    }
    Back
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
