nacaAirfoil_n0012familyII2hex_compressible_SST/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    front
    {
        type            empty;
    }
    Back
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
