nacaAirfoil_n0012familyII2hex_compressible_SST/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 25000;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    front
    {
        type            empty;
    }
    Back
    {
        type            empty;
    }
    walls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 25000;
    }
}


// ************************************************************************* //
