nacaAirfoil_n0012familyII2hex_compressible_SST/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    front
    {
        type            empty;
    }
    Back
    {
        type            empty;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }
}


// ************************************************************************* //
